# Brewfile -*- mode: ruby; -*-
# Time-stamp: <2026-03-17 21:53:27 Tuesday by zhengyu.li>
# =============================================================================
# Homebrew Bundle - oh-my-dotfiles Package List
#
# Location: ~/oh-my-dotfiles/homebrew/Brewfile  (not stowed; run directly)
# References:
#   1. Homebrew Bundle Docs: https://github.com/Homebrew/homebrew-bundle
#   2. brew bundle usage: https://docs.brew.sh/Manpage#bundle-subcommand
# Note: Run with: brew bundle --file=~/oh-my-dotfiles/homebrew/Brewfile
# =============================================================================

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------

cask "font-sauce-code-pro-nerd-font" # Monospace font with icons

# -----------------------------------------------------------------------------
# Shell Environment
# -----------------------------------------------------------------------------

brew "zsh"                      # Shell
brew "starship"                 # Cross-shell prompt
brew "direnv"                   # Per-directory environment variables
brew "zoxide"                   # Smart cd command with frecency
brew "carapace"                 # Universal shell completion

# -----------------------------------------------------------------------------
# Version Control
# -----------------------------------------------------------------------------

brew "git"                      # Version control system
brew "lazygit"                  # Simple terminal UI for git commands

# -----------------------------------------------------------------------------
# Security & Encryption
# -----------------------------------------------------------------------------

brew "gnupg"                    # GNU Privacy Guard (GPG)
brew "pass"                     # Password store (pass)
brew "pinentry"                 # GPG passphrase entry

# -----------------------------------------------------------------------------
# File Search & Viewing
# -----------------------------------------------------------------------------

brew "fzf"                      # Fuzzy finder
brew "ripgrep"                  # Fast grep replacement (rg)
brew "fd"                       # Fast find replacement
brew "eza"                      # Modern ls replacement with icons and git
brew "bat"                      # Cat clone with syntax highlighting

# -----------------------------------------------------------------------------
# Build Tools
# -----------------------------------------------------------------------------

brew "autoconf"                 # Auto configuration script generator
brew "automake"                 # Makefile generator
brew "cmake"                    # Cross-platform build system
brew "pkg-config"               # Library configuration helper
brew "libtool"                  # Generic library support script
brew "ninja"                    # Small build system with focus on speed

# -----------------------------------------------------------------------------
# Compiler & Libraries
# -----------------------------------------------------------------------------

brew "llvm"                     # C/C++ compiler toolchain (provides clangd)
brew "libvterm"                 # Terminal emulator library
brew "openssl@3"                # Cryptography library (TLS/SSL)
brew "readline"                 # Command line editing library
brew "zlib"                     # Compression library
brew "libffi"                   # Foreign Function Interface library
brew "ncurses"                  # Terminal UI library
brew "xz"                       # LZMA compression library
brew "bzip2"                    # Burrows-Wheeler compression

# -----------------------------------------------------------------------------
# Document Tools
# -----------------------------------------------------------------------------

brew "pandoc"                   # Universal document converter

# -----------------------------------------------------------------------------
# Spell Checking
# -----------------------------------------------------------------------------

brew "aspell"                   # Spell checker

# -----------------------------------------------------------------------------
# Terminal Tools
# -----------------------------------------------------------------------------

brew "tmux"                     # Terminal multiplexer
cask "ghostty"                  # Fast, native terminal emulator

# --- File Manager (yazi) ---
brew "yazi"                     # Blazing fast terminal file manager
brew "ffmpegthumbnailer"        # Video thumbnails for yazi
brew "sevenzip"                 # Archive extraction for yazi
brew "poppler"                  # PDF preview for yazi

# -----------------------------------------------------------------------------
# Text Editors
# -----------------------------------------------------------------------------

brew "neovim"                   # Hyperextensible Vim-based editor
cask "emacs-app"                # Emacs text editor

# -----------------------------------------------------------------------------
# Data Processing
# -----------------------------------------------------------------------------

brew "jq"                       # JSON processor
brew "yq"                       # YAML processor

# -----------------------------------------------------------------------------
# System Utilities
# -----------------------------------------------------------------------------

brew "wget"                     # HTTP downloader
brew "htop"                     # Process viewer
brew "coreutils"                # GNU core utilities (gls, etc.)
brew "stow"                     # Symlink farm manager for dotfiles

# -----------------------------------------------------------------------------
# Language Runtimes & Modern Toolchain
# -----------------------------------------------------------------------------

# Bun -- JavaScript/TypeScript runtime + package manager
tap "oven-sh/bun"
brew "oven-sh/bun/bun"

# uv -- Python package manager (replaces pyenv/pip)
brew "uv"

# Go -- Go runtime
brew "go"

# -----------------------------------------------------------------------------
# Window Management
# -----------------------------------------------------------------------------

cask "rectangle"                # Window management
