# Brewfile -*- mode: ruby; -*-
# Time-stamp: <2026-03-22 10:25:04 Sunday by zhengyuli>
#
# =============================================================================
# Homebrew Bundle - oh-my-workspace Package List
#
# Author: zhengyu li <lizhengyu419@outlook.com>
# Keywords: homebrew, packages, dependencies
#
# Copyright (C) 2026 zhengyu li
#
# History:
#   2026-03-22 10:25 zhengyu li <lizhengyu419@outlook.com> created.
#
# Commentary:
#   Declarative package manifest for all tools managed by this dotfiles
#   repository.  Run with:
#     brew bundle --file=$WORKSPACE_DIR/pkg-manager/homebrew/Brewfile
#
# References:
#   1. Homebrew Bundle: https://github.com/Homebrew/homebrew-bundle
#   2. brew bundle usage: https://docs.brew.sh/Manpage#bundle-subcommand
# =============================================================================

# -----------------------------------------------------------------------------
# Development & Testing
# -----------------------------------------------------------------------------
# Bash/Zsh test framework
brew "bats-core"
# Shell script static analysis tool
brew "shellcheck"

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------
# Monospace font with icons
cask "font-sauce-code-pro-nerd-font"

# -----------------------------------------------------------------------------
# Shell Environment
# -----------------------------------------------------------------------------
# Shell
brew "bash"
brew "zsh"
# Cross-shell prompt
brew "starship"
# Per-directory environment variables
brew "direnv"
# Smart cd command with frecency
brew "zoxide"
# Universal shell completion
brew "carapace"

# -----------------------------------------------------------------------------
# Version Control
# -----------------------------------------------------------------------------
# Version control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Syntax-highlighting pager for git diff
brew "git-delta"

# -----------------------------------------------------------------------------
# Security & Encryption
# -----------------------------------------------------------------------------
# GNU Privacy Guard (GPG)
brew "gnupg"
# Password store (pass)
brew "pass"
# GPG passphrase entry
brew "pinentry"

# -----------------------------------------------------------------------------
# File Search & Viewing
# -----------------------------------------------------------------------------
# Fuzzy finder
brew "fzf"
# Fast grep replacement (rg)
brew "ripgrep"
# Fast find replacement
brew "fd"
# Modern ls replacement with icons and git
brew "eza"
# Cat clone with syntax highlighting
brew "bat"

# -----------------------------------------------------------------------------
# Build Tools
# -----------------------------------------------------------------------------
# Auto configuration script generator
brew "autoconf"
# Makefile generator
brew "automake"
# Cross-platform build system
brew "cmake"
# Library configuration helper
brew "pkg-config"
# Generic library support script
brew "libtool"
# Small build system with focus on speed
brew "ninja"

# -----------------------------------------------------------------------------
# Compiler & Libraries
# -----------------------------------------------------------------------------
# C/C++ compiler toolchain (provides clangd)
brew "llvm"
# Terminal emulator library
brew "libvterm"
# Cryptography library (TLS/SSL)
brew "openssl@3"
# Command line editing library
brew "readline"
# Compression library
brew "zlib"
# Foreign Function Interface library
brew "libffi"
# Terminal UI library
brew "ncurses"
# LZMA compression library
brew "xz"
# Burrows-Wheeler compression
brew "bzip2"

# -----------------------------------------------------------------------------
# Document Tools
# -----------------------------------------------------------------------------
# Universal document converter
brew "pandoc"

# -----------------------------------------------------------------------------
# Spell Checking
# -----------------------------------------------------------------------------
# Spell checker
brew "aspell"

# -----------------------------------------------------------------------------
# Terminal Tools
# -----------------------------------------------------------------------------
# Terminal multiplexer
brew "tmux"
# Fast, native terminal emulator
cask "ghostty"

# --- File Manager (yazi) ---
# Blazing fast terminal file manager
brew "yazi"
# Video thumbnails for yazi
brew "ffmpegthumbnailer"
# Archive extraction for yazi
brew "sevenzip"
# PDF preview for yazi
brew "poppler"

# -----------------------------------------------------------------------------
# Text Editors
# -----------------------------------------------------------------------------
# Hyperextensible Vim-based editor
brew "neovim"
# Emacs text editor
cask "emacs-app"

# -----------------------------------------------------------------------------
# Data Processing
# -----------------------------------------------------------------------------
# JSON processor
brew "jq"
# YAML processor
brew "yq"
# Interactive JSON viewer
brew "fx"

# -----------------------------------------------------------------------------
# System Utilities
# -----------------------------------------------------------------------------
# HTTP downloader
brew "wget"
# Process viewer
brew "btop"
# GNU core utilities (gls, etc.)
brew "coreutils"
# Simplified man pages
brew "tldr"
# macOS input source manager
tap "laishulu/homebrew"
brew "laishulu/homebrew/macism"
# Deep clean and optimize your Mac
brew "mole"

# -----------------------------------------------------------------------------
# Language Runtimes & Modern Toolchain
# -----------------------------------------------------------------------------
# Bun -- JavaScript/TypeScript runtime + package manager
tap "oven-sh/bun"
brew "oven-sh/bun/bun"

# uv -- Python package manager (replaces pyenv/pip)
brew "uv"

# Node.js -- some Claude Code plugins require node directly
# (primary runtime is bun; node is for compatibility only)
brew "node"

# Python -- fallback for scripts requiring system python3
# (primary package manager is uv; python is for compatibility only)
brew "python"

# Go -- Go runtime
brew "go"

# Rustup -- Rust toolchain installer and version manager
brew "rustup"

# Lua -- lightweight scripting language (yazi plugins, neovim config, etc.)
brew "lua"

# -----------------------------------------------------------------------------
# Window Management
# -----------------------------------------------------------------------------
# Window management
cask "rectangle"

# -----------------------------------------------------------------------------
# Productivity
# -----------------------------------------------------------------------------
# Application launcher and productivity tool
cask "raycast"
